Revit 2017 API
StructuralSectionZProfileWithLips Class
 Defines parameters for Z Profile with lips structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionZProfileWithLips : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionZProfileWithLips _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionZProfileWithLips : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips
See Also
StructuralSectionZProfileWithLips Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace